Tekla.Structures.Dialog.UIControls.PropertiesDialog
The PropertiesDialog class represents a "template" of a properties dialog.

Tekla.Structures.Dialog.UIControls.PropertiesDialog.#ctor
Initializes a new instance of the PropertiesDialog class.

Tekla.Structures.Dialog.UIControls.PropertiesDialog.OnLoad(System.EventArgs)
The properties dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.PropertiesDialog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.PropertiesDialog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.PropertiesDialog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.

Tekla.Structures.Dialog.UIControls.PropertiesDialog.instruccionsLabel
The instruccionsLabel contains instructions for the dialog (to be changed by the user).

Tekla.Structures.Dialog.UIControls.PropertiesDialog.propertiesTabControl
The propertiesTabControl: tab control containing properties.

Tekla.Structures.Dialog.UIControls.PropertiesDialog.mainGroupBox
The mainGroupBox (to be changed by the user).

Tekla.Structures.Dialog.UIControls.PropertiesDialog.optionalGroupBox
The optionalGroupBox (to be changed by the user).

Tekla.Structures.Dialog.UIControls.PropertiesDialog.optionalContentsLabel
The optionalContentsLabel (to be changed by the user).

Tekla.Structures.Dialog.UIControls.PropertiesDialog.mainContentsLabel
The mainContentsLabel (to be changed by the user).

Tekla.Structures.Dialog.UIControls.PropertiesDialog.tabPage1
The tabPage1: options tab page (to be changed by the user).

Tekla.Structures.Dialog.UIControls.PropertiesDialog.tabPage2
The tabPage2: options tab page (to be changed by the user).

Tekla.Structures.Dialog.UIControls.PropertiesDialog.okCancel
The okCancel: group of buttons for Ok/Cancel.